{
  "content": [
    {
      "id": "hithardbycovid",
      "title": "India’s millennials have been hit hard by the Covid recession",
      "summary": "An unemployment crisis is crushing the country’s growth. Last August, Indore, a bustling city of two million people in India’s Madhya Pradesh state, earned the title of the country’s cleanest city for the fourth consecutive year...",
      "link": "https://www.newstatesman.com/world/asia/2021/03/india-s-millennials-have-been-hit-hard-covid-recession",
      "route": "/indian-millennials-hit-hard-covid",
      "author": "Vivan Marwaha",
      "date": "March 10, 2021",
      "img": "https://www.newstatesman.com/sites/default/files/styles/cropped_article_image/public/blogs_2021/03/gettyimages-1227670398.jpg?itok=Mi9eQiII&c=a3bb9128ee00cab97860a3889e12c99a",
      "alt": "Millennials are constantly reminded about life in India’s big cities and beyond, and are well aware of the opportunities and the wealth accumulated by those living in these places.",
      "full": "Last August, Indore, a bustling city of two million people in India’s Madhya Pradesh state, earned the title of the country’s cleanest city for the fourth consecutive year. When I visited Indore in 2019, however, it wasn’t the clean streets I was struck by, but the hundreds of private coaching and test preparation centres attracting students from all over the country. \nPart of a $7.5bn industry, these academies have been propelling increasing numbers of Indian students towards a limited number of government jobs and places at prestigious engineering colleges and medical schools. Jeet Singh, 24, has devoted three years following his engineering degree to studying full-time for the UPSC examination, a civil service exam which would enable him to join the Indian government as a bureaucrat. “By any means necessary, I need to find a government job. It’s the only way I will have stability in my life,” he told me over tea. \nSingh’s story is far from unique. Over the last two years I have spoken to more than 900 of the country’s 440 million 25- to 40-year-olds as part of my research into the aspirations and anxieties of Indian millennials. What I found in nearly every town was a version of the same story: that India has a serious youth unemployment crisis on its hands. \nIn 2019, before Covid-19 brought global economic activity to a near standstill, data released by India’s Ministry of Statistics showed unemployment in the country was at a 45-year high. Unemployment among the well-educated was also at record levels: nearly three times the national average, according to a 2018 study by the Azim Premji University. \nThis has now been exacerbated by the fallout from the pandemic. The absence of uniform government data makes it hard to source exact unemployment rates, but an October-November 2020 survey of nearly 10,000 millennials conducted by Mint newspaper found 17 percent had lost their jobs since the pandemic began. \nMany young adults around the world have faced huge job losses in the last year, but India’s lack of a safety net makes its youth particularly vulnerable to poverty and economic insecurity. “Other countries are ageing while India gets younger. This means that lower wages and a decline in economic productivity due to the pandemic will compound the magnitude of the problem in India,” the economist Radhicka Kapoor told me. \n“Human capital accumulation, job growth, and skill development were all suspended during the pandemic,” Kapoor added. As millions lost their jobs, many had to turn to MGNREGA, a government programme that guarantees 100 days of unskilled manual labour in rural areas and pays roughly $3 a day. Almost 17 million new workers applied to access the programme between April and September 2020, and 60 million households participated in the programme during that period – the highest number in its 14-year history. \nA visit to any town outside the country’s major population centres makes India’s unemployment crisis stark. Scores of young men, seemingly unemployed and disengaged from economic activity, spend their time in an activity so widespread it has earned its own term: “timepass”, or the act of killing time playing games and hanging out with friends in town squares. \nThese young men and women are supposed to be India’s “demographic dividend”, a term used by investors, economists and academics to refer to the potential economic contribution of the country’s youth. Prime Minister Narendra Modi wants India to become a $5trn economy by 2024, and millennials are supposed to power this nation-building effort by pushing up levels of earning and spending. \nBut India currently lacks the most important pillar of this growth: jobs. In 2018, a job advertisement put out by the state government of Uttar Pradesh to fill 62 “messenger” (or postman) positions received more than 93,000 applications, including from 3,700 people with PhDs, 28,000 post-graduates and 50,000 college graduates. The same year, when 63,000 positions within railway maintenance, 19 million Indians applied. These are some of the most junior positions in the country’s sprawling bureaucracy, paying roughly $250 a month. \nGovernment jobs, defined by a reputation of stability, are in particular demand among Indian millennials. An extensive survey of Indian youth conducted by the Centre for the Study of Developing Societies found that 65 per cent of young adults listed a government job as a top priority, and only 7 per cent wanted a job in the private sector. This is because the private sector has not been able to create the volume of stable employment that India’s youth needs. \nThe Indian government has used the pandemic to pass labour reforms that make the country more competitive for foreign investment in the private sector. These reforms make it easier to lay off workers and limit the power of trade unions in the country, changes which big businesses say will facilitate investment in India. But they may also continue to push young Indians towards government jobs, as private employment becomes even less secure than before. \nIn other cases, local politics has undermined national policy: state governments in the country have begun ordering private industry and businesses to reserve jobs for locals. In 2019, the state government of Andhra Pradesh passed a bill to reserve 75 per cent of private industrial jobs for its own people, becoming the first province to take such a step. Last week, the state government of Haryana, a wealthy IT and industrial hub that is home to the offices of nearly 250 Fortune 500 companies including Google and IBM, implemented a similar bill, reserving 75 per cent of all private jobs with a pay ceiling of nearly $800 for its own citizens. \nInstead of creating the conditions for long-term job growth, state executives are increasingly reserving existing jobs for their voters. These moves could not just hurt further investment in India and challenge the free movement and employment of people within their own country, but also accelerate poverty in poorer states by making it harder for people to secure jobs elsewhere. \nSuch state intervention does nothing to create new jobs and is akin to putting a plaster on a bullet wound. It could also Balkanise the country when it needs to come together to create a national consensus prioritising widespread employment creation for its youth. Writing about Haryana’s new job reservations, the academic Pratap Bhanu Mehta called the law “constitutionally indefensible” and “politically cynical”, stating that “the fact that states feel the need to enact these bills is an indictment of the economy as a whole”. \nMeanwhile, time is of the essence for India’s millennials because, as Pronab Sen, a former chief statistician of India, told me, “the last thing you want is a generation which has squandered the best years of its life. It will create huge social problems as well”. "
    },
    {
      "id": "hopesandanxieties",
      "title": "Hope and Anxiety Among Liberalization’s Children",
      "summary": "In my field work across small-town India, one of the most glaring things that stands out to me is the high rate of unemployment. As I traveled to town after town during the 2018 Madhya Pradesh state elections, one sight had become eerily familiar to me: hordes of young and middle-aged people, mostly men, spending their time at public squares, seemingly unemployed and disengaged from economic activity.",
      "link": "https://whatmillennialswant.blog/2020/01/02/hope-and-anxiety-among-liberalizations-children/",
      "route": "/hope-and-anxiety-among-liberalizations-children",
      "author": "Vivan Marwaha",
      "date": "December 31, 2019",
      "img": "https://images.livemint.com/img/2019/12/31/600x338/Hope_1577804079817.jpg",
      "alt": "Millennials are constantly reminded about life in India’s big cities and beyond, and are well aware of the opportunities and the wealth accumulated by those living in these places.",
      "full": "Whenever I discuss my research on Indian millennials, most people assume that I’m talking about the social-media addicted youth they see in Delhi or Mumbai, glued to their smartphones and in pursuit of instant gratification. While that image might fit a very small minority of millennials, reality tells a starkly different story. \nBorn between 1981 and 1996, millennials grew up in an India in the midst of rapid social, cultural, and economic change. The forces of economic liberalization, introduced in 1984, but unleashed in 1991, changed the nature of the Indian economy and ushered in unprecedented levels of foreign investment, which is why we are told that liberalization ‘transformed’ India. \nBut as I’ve spent the last two years essentially camped out in India’s small towns and cities, my assumptions on the advertised benefits of liberalization have been fundamentally challenged. Textbook economic theory of greater investment, an increase in white collar jobs, and the entry of multinationals appears to have limited weight and impact outside India’s metropolitan cities. And for older millennials—born in the early 1980s and now on the other side of 35—while liberalization encouraged incredible aspirations and the promise of opportunity, the avenues to pursue them were few. \nI see this most clearly in my field work in Madhya Pradesh. In the winter of 2018, I spent weeks in the state during its assembly elections. As I travelled to town after town, one sight had become eerily familiar to me: hordes of young and middle-aged people, mostly men, spending their time at public squares, seemingly unemployed and disengaged from economic activity. \nJabalpur is considered one of Madhya Pradesh’s economic centres. At the time of independence, it was a vibrant industrial hub of central India, and is still home to one of the government’s largest ordnance factories. I expected to find a thriving working class population given the city’s history as a manufacturing hub. Instead, I encountered a city of more than one million people in decline. As I shadowed local candidates canvassing for votes, the biggest issues raised to me were the ongoing agricultural crisis and unemployment. The youth I met broadly came from two groups: rural labour who were not currently needed on the farm, and contractual workers who were laid off due to the economic downturn. Both were casualties of liberalization. \nToday’s Jabalpur is a shadow of its former self, largely because liberalization created disproportionate growth in the services industry—encouraged by globalization-fuelled cost arbitrage—instead of manufacturing, which absorbs more people. It is remarkable how the manufacturing sector’s contribution to India’s GDP has remained unchanged since liberalization. \nBut the cruelty of their situation is exacerbated by the fact that as a whole, millennials are better educated than previous generations. An intensive focus on increasing enrolment at the school level, along with an increase in the access to public and private higher education has created millions of degree-holders who are either unemployed or employed in positions which are not commensurate with their qualifications. Although this labour undervaluation is also a product of the quality of education attained, which leaves a lot to be desired, neither the promise of education nor liberalization has provided them with well-paid and stable employment. \nOne evening after campaigning had finished, I was at a snack stall where I began talking to the owner, a 32-year-old civil engineer and first-generation graduate. After he was laid off from a construction company four years ago, no one was willing to hire him and he could not move elsewhere because he had to look after his ailing parents. So he opened a snack stall, which sells pakoras, kachoris and tea. After expenses, he brings home about ₹5,000 every month. His wife, a librarian at a private school, makes ₹12,000, which is how the family primarily sustains itself. \n'Being an engineer doesn’t mean much. I wish I had applied for a government job instead. I would have at least had a stable income and been able to provide for my family,' he told me. \nHis wife is an anomaly, given women’s participation in the workforce has fallen sharply since 2000. She only works because her husband doesn’t make enough. A World Bank study found that nearly 20 million women dropped out of the workforce between 2004 and 2012, and a Tata Sons-Dalberg analysis estimated that approximately 120 million women in India have a secondary education but do not participate in the workforce. The snack stall owner’s example suggests that their involvement in the labour force can save families from destitution, and the Tata-Dalberg study further found that their employment can add ₹31 trillion, or roughly $440 billion, to India’s GDP, but a variety of structural inequities disable women from joining the workforce: from existing social taboo and gender norms to safety and mobility. \nWhile we often discuss statistics that tell us the Indian economy needs to add one million jobs every month to keep its youth occupied, or that employment needs to grow by 3% every year but has grown at approximately half that number, we forget about older millennials who have families to support and children to educate. \nAccording to government data, the median age at marriage in India continues to hover around 19 years for women and 23 for men, which indicates that the median older millennial is a parent to one or two children. Juggling parental responsibilities with finding or maintaining stable employment in an economy which is shedding jobs has created incredible anxiety among liberalization’s children. The double whammy of women missing from the workforce and the lack of vibrant employment opportunities is the biggest hurdle stopping older millennials unlocking their greatest economic potential. \nAlthough I had gone to Jabalpur to investigate the economic aspirations, social views, and political attitudes of millennials, I was left with more questions. But the biggest one gnawing at me was about the breadth and width of liberalization—since it clearly wasn’t enough. \nAspiration and reality \nA few hours away from Jabalpur, in the state’s capital, Bhopal, I met Jalaj Sharma, a 35-year-old money manager. After graduating with a degree in engineering from Mandsaur Institute of Technology, he ignored his government doctor parents who were pleading with him to study for the UPSC. \nFor the same, or less, effort, I knew I would be able to find a well-paid job in the private sector,' he told me. \nSharma got a master’s degree in finance next, and soon found a job at HDFC Bank. in Mumbai, where his starting salary was ₹24,000 a month. 'My peers and I knew that stability wouldn’t be an issue. We only cared about promotions and growth, and it is a fact that the private sector would give us much greater career progression than any supposedly stable job in the government,' he said, \nTwo years later in 2009, he bought his first car, a Maruti Alto, with the help of a loan, and after working in Bengaluru for a few years, he moved back to Madhya Pradesh, where he started a successful wealth management business in Bhopal. His clients largely include retired government servants looking to invest their pensions. \n“Joining the public sector and getting promoted would have been harder for me as a general category applicant,' he added. \nWith the implementation of the Mandal Commission report in 1990 and the subsequent economic liberalization in 1991, many forward caste members who had advanced degrees essentially vacated government service and dominated the nascent private sector. For this subset of educated young Indians, liberalization kicked off a 10-year boom in 2000 with the creation of thousands of high-paying jobs and opportunities that were unthinkable a few years earlier. \nNoida, Gurugram, Bandra Kurla Complex, Whitefield and HITEC City rapidly eclipsed Connaught Place and Colaba as the hotbeds of economic power, fuelled by talented Indians joining companies lured to these areas in search of selling products and services to India’s growing middle class. \nHowever, liberalization’s bounty has been concentrated in a few enclaves in India’s biggest cities, where pricey shopping malls and fancy office complexes stand on land considered remote just a few decades ago. As the reforms were primarily focused on the formal sector, the informal and non-corporate sectors—where a majority of India’s population finds its employment—continued to remain shackled. As a corollary, most individuals linked to the formal sector were able to capitalise on the economic churn, while those in the informal sector were expected to benefit from trickle-down economics. \nA study by the International Labour Organization found that while the average wage of the Indian worker doubled from 1990 to 2010, the median wage failed to keep pace, implying that a small minority of workers were skewing the mean wage upwards. Further, a majority of the new jobs added from 2000 were in the low-productivity informal sector, where most workers make less than ₹11,000 a month, roughly half of their counterparts in the formal sector. This is why we see news reports of millions applying for peon-level positions in the government. A stable, decent-paying job is better than unstable and poorly compensated work \nIn an ideal situation, liberalization would have ushered in a migration from the farm to the factory. The lack of broad manufacturing policies created a situation where the factory was skipped and inequality exacerbated: where most workers are still toiling on farms or odd jobs for low pay, while a small group of white-collar workers makes unprecedented sums of money in the services sector \n This essay is not meant to demonize wealth creation; its intent is to shine a light on wealth expansion. Jalaj Sharma and the snack stall owner are both small-town millennials, educated and running their own businesses yet each has had a vastly different experience from liberalization. Being a millennial and growing up with open markets hasn’t meant the same access to opportunity. But it has meant the same aspirations—of doing better than their parents, owning a house and a car, and being able to provide a comfortable life for their children. \nToday, millennials across classes and geographies are more equal than ever in their access to information. The introduction of new television channels in the 1990s and the data and smartphone revolution currently underway has created India’s most aspirational generation. Millennials are inundated with ads about new cement to build houses, home loans to finance their construction, and paint to finish them, but many are not able to afford their own homes. \nGiven that they grew up before the economy liberalized, older millennials are happy to have left the lack of choice and opportunity in socialist India behind, but many feel the old rules still apply. Crucial networks of class and caste continue to play an important role in accessing opportunity. Government jobs are as competitive and desirable as earlier, while success in the private sector is still determined by one’s privilege. While aspirations have evolved, reality hasn’t kept pace \nOpinion is subjective but data objective. Although liberalization accelerated India’s GDP growth, it failed to turbocharge job creation and change the structure of the job market. Finding answers to expand the benefits of liberalization and create millions like Sharma is the need of the hour."
    },
    {
      "id": "allaboutmodipersonality",
      "title": "For Indian millennials, 2019 is going to be all about Modi’s personality not policy",
      "summary": "Four years after Narendra Modi stormed the hustings with unprecedented support from first-time voters, there is much speculation about whether he has sustained his charm among the youth ahead of the upcoming 2019 general election.",
      "link": "https://theprint.in/opinion/for-indian-millennials-2019-is-going-to-be-all-about-modis-personality-not-policy/89629/",
      "route": "/2019-is-all-about-modi's-personality",
      "author": "Vivan Marwaha",
      "date": "July 28, 2018",
      "img": "https://static.theprint.in/wp-content/uploads/2018/07/GettyImages-689961136-e1532698919417-696x436.jpg",
      "alt": "Image of Modi",
      "full": "Four years after Narendra Modi stormed the hustings with unprecedented support from first-time voters, there is much speculation about whether he has sustained his charm among the youth ahead of the upcoming 2019 general election. \nI have spent the last year doing field research for my forthcoming book on Indian millennials, speaking to hundreds of young Indians across big cities and small towns. While my respondents cut across socio-economic lines, I found one common trend: 2014 was about the promise of “acche din”, and 2019 is likely to be about personality instead of policy. \n“Modi has never cared about being popular or well-liked. If he did, he would never have become the chief minister of Gujarat or the Prime Minister of India. He only cares about the country, and he doesn’t mind antagonising his own vote base to make India more prosperous,” a young Modi supporter from Indore said. He belonged to a merchant family who lost significant revenue after demonetisation and the flawed GST implementation. \nAccording to figures released by the Centre for the Study of Developing Societies, youth turnout in 2009 was a paltry 54 per cent, four points lower than the national average. In 2014, it rose to 68 per cent and was two points higher than the national average. Of these young voters, the BJP’s vote share was 34.4 per cent, three points higher than its national average of 31.1 per cent. Young voters were the BJP’s largest voting bloc. \nMillennials— those between the age of 20 and 35— are one of India’s largest distinct generation. Estimated to number 400 million, they are a third of the country’s population, and almost half its workforce. They are first and second-time voters, and in many ways, they are the ‘swing voters’ every party will be looking to win over in the next general election. \nMy respondents were from all over the country with a particular focus in Tier 2 and 3 cities. \n‘Anti-corruption’ and ‘decisive’ were the most common words the millennials used about Modi. Millennials in bigger cities had mixed feelings about Modi, blaming him for the increase in hate crimes and polarisation. The young respondents in small towns were politically active on Facebook, had liked pro-Modi pages and regularly shared pro-Modi content on social media. They identified personally with him and experienced a big urge to defend any attacks on him. Many younger men in these smaller cities were also members of pro-Modi WhatsApp groups, which were hubs of pro-BJP propaganda and fake news. \nAfter 10 years of Congress government, many young Indians did not find former Prime Minister Manmohan Singh’s leadership aspirational and wanted a complete reboot. UPA II’s litany of corruption scandals and the slowing economy did not help much either. \nIn Modi, young Indians saw a saviour who gets things done. His personal story—the son of a tea seller who rose to become a chief minister, regularly publicised by himself and the BJP—was hailed as an ‘Indian Dream’ success story. Modi was a refreshing break from the status quo. \nMany young small towners continue to see themselves in Modi due to his outsider status in Delhi, and his use of Hindi instead of English. \nWhile elites in New Delhi and Mumbai dismiss his surgical strikes and rhetoric against Pakistan as mere talking points, they resonate in the Hindi hinterland— especially his appeal as a strongman and a leader who doesn’t bend down to Pakistan. \nAlthough demonetisation is acknowledged by most millennials as a failed policy, many still support it as a crackdown on corruption and black money. ‘It hurt me, but it hurt the rich guys even more’ was the dominant sentiment. Demonetisation was seen as an example of bold decision-making. As the top 1 per cent continues to amass more wealth and power in the country, Modi is seen as one of the few remaining leaders who will put an end to entrenched corruption. \nThe young today are looking for leaders who don’t back down. Ever since 2013, when he proclaimed he doesn’t want to become the Prime Minister, but the ‘chowkidar’ of Indians, Modi’s campaign speeches never fail to include his desire to protect Indians from enemies foreign and domestic. \nIndian millennials value action and strong leadership, and Modi gives them both. Of course, there were communal undertones to a lot of the responses I heard. He shows Muslims their ‘place’ and is reviving Hindu culture, is something many said. \nAs millions of millennials face severe unemployment in smaller cities and the countryside – a result of massive labour supply but total lack of demand – they are turning towards Hindu nationalism and conservatism. The abundance of free time and lack of avenues to engage in productive activity leads them to blame ‘others’ – usually Muslims or Dalits – for endangering their culture and opportunities. This segment of his younger Hindu base views Modi’s controversial handling of the 2002 Godhra riots as a positive attribute. \nWhat I found most interesting was the fact that most millennials I interviewed could not tell me about any specific Modi policy or proposal that they supported or cheered. It was almost like his policies did not matter. I even broke the journalistic code by asking leading questions with specific policies, such as ‘Make in India’ or ‘Swachh Bharat’, but I never got any enthusiastic response. \nTo millennials, personality matters more than policy. Modi is more of a father-like figure leading an economic and social revival in the country, even though the benefits might not be felt by everyone."
    },
    {
      "id": "indiantechnicaleducation",
      "title": "Indian technical education needs wholesale reform",
      "summary": "Last month, as part of my research for my book on Indian millennials, I visited and spent a few days at the Infosys headquarters in Bangalore and the company’s 330-acre campus in Mysore. I was there to...",
      "link": "https://timesofindia.indiatimes.com/blogs/millennial-matters/indian-technical-education-needs-wholesale-reform/",
      "route": "/indian-technical-education-needs-wholesale-reform",
      "author": "Vivan Marwaha",
      "date": "September 17, 2018",
      "full": "Last month, as part of my research for my book on Indian millennials, I visited and spent a few days at the Infosys headquarters in Bangalore and the company’s 330-acre campus in Mysore. I was there to observe Infosys’ new hire training process, during which the company was currently training more than 10,000 new hires as they formally join the ranks of the company. The scope and scale of Infosys’ training programs at Mysore have earned it the distinction of being the world’s largest corporate training center. \nWhat I saw at Mysore – a futuristic campus built along the lines of Google’s headquarters in Mountain View, California – was awe inspiring. With state-of-the-art classrooms, accommodation, and recreational facilities, Infosys has invested hundreds of crores in training its new hires. Largely hired directly from college campuses across the country, they spend anywhere between 19 to 25 weeks in Mysore in foundational training to learn how to code and program, and perform other essential business tasks required of Infosys employees. Back of the envelope estimates find that the company spends approximately Rs. 5 lakhs on every new employee through the duration of their training. \nThat’s more than the cost of an entire education at most Indian universities. \nIt is a well-known fact that most Indian technical institutions, particularly private colleges in Tier 2 and 3 cities, have become notorious for issuing degrees with little substance. A high-ranking executive responsible at a prominent staffing firm told me, “Indian engineering colleges simply deliver engineers into the system. The engineers who graduate and come out know certain things which are far from what the industry needs.” \nThe problem is so acute that a 2017 report released by the employability assessment firm Aspiring Minds found that a whopping 95% of Indian engineering graduates cannot even write or perform basic code, and only under 4% are employable for software roles at startups. As India experienced its own version of the American dot-com bubble in the early 2000s, millions of young men and women in the middle class chose to get their degrees in engineering or computer science, hoping to join the ranks of local outsourcing giants Tata Consultancy Services, Wipro, or Infosys. As these companies began hiring hundreds of thousands of young engineers, more and more students aspired to become engineers. \nSoon, the supply for engineers far outstripped demand, a problem exacerbated by an IT sector that has recently been shedding jobs, accompanied by the proliferation of thousands of low-quality engineering colleges across the country. \nInstead of relying on the education system to provide it with qualified engineers, Infosys developed and implemented its own foundation program to train and skill them. Instead of hiring for skills, the company hires for aptitude, a telling indicator that it is not looking for existing knowledge, but the ability to absorb new information. Although a large part of its training is in soft skills, which most colleges do not teach anyway, the company has made itself responsible for training its talent in how to think about programming and become adaptive engineers – which is, in fact, a responsibility of any progressive and modern education system. \nAs the Modi government seeks to ‘Make in India’ and create a ‘Digital India,’ its initiatives are hobbled by a poorly educated and trained labor force. Although Infosys new hires have the privilege of essentially getting six months of a fully-paid training to ensure they are skilled enough to perform their jobs, the company only hires about 10 – 15,000 engineers annually, a mere fraction of the roughly 1.5 million engineers who graduate every year. \nWhile there are no easy fixes available, the government needs to begin with cracking down on private engineering colleges. Similar to snake oil salesmen, there are hundreds, if not thousands, of poorly regulated engineering institutions offering students poor-quality degrees. The AICTE has already begun clamping down on college accreditation, but it will need to step up its quality monitoring programs, and perhaps even issue scorecards for institutions to allow students to make informed decisions while applying to colleges. Secondly, private sector corporations and companies must begin partnering with institutions – public and private – in offering students internships, externships, and other job training opportunities. This will ensure current students are exposed to real-world challenges and problem solving, and can practically use their classroom education. \nIndian society continues to place an exaggerated emphasis and aspiration on becoming an engineer. However, while getting an engineering degree was a ticket to a good-paying job and a middle-class life a few decades ago, that is no longer the case. An excess glut of engineers and a dire jobs crisis has led many BTech graduates to forego their degrees to become peons and couriers for government agencies, stories which are becoming increasingly common."
    },
    {
      "id": "millenialsformodi",
      "title": "The secret behind millennial support for India’s Modi",
      "summary": "As the dust settles on India’s general elections, one thing has become clear: Despite a record-high unemployment rate, a slowing economy and widespread agrarian distress, Indians have overwhelmingly decided to give Prime Minister Narendra Modi and his Bharatiya Janata Party a second chance to put the country back on track.",
      "link": "https://whatmillennialswant.blog/2019/05/30/the-secret-behind-millennial-support-for-prime-minister-modi/",
      "route": "/the-secret-behind-millennial-support-for-india's-modi",
      "author": "Vivan Marwaha",
      "date": "May 24, 2019",
      "img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DH5KZ2T5XYI6TMPTWIZ74WAR54.jpg&w=916",
      "alt": "A supporter of India's ruling Bharatiya Janata Party wearing a mask of Indian Prime Minister Narendra Modi shows the victory sign while celebrating Modi's early lead at the party's state headquarters in Hyderabad, India, on Thursday. (Mahesh Kumar A./AP)",
      "full": "Vivan Marwaha is the author of a forthcoming book on Indian millennials. \nAs the dust settles on India’s general elections, one thing has become clear: Despite a record-high unemployment rate, a slowing economy and widespread agrarian distress, Indians have overwhelmingly decided to give Prime Minister Narendra Modi and his Bharatiya Janata Party a second chance to put the country back on track. \n This time around, Modi may not have campaigned as an outsider determined to oust the ruling elites. But once again, in a country with an estimated 84 million first-time voters and a median age of just under 28, Modi appears to have ridden a wave of millennial support on his way to a landslide victory. \nAlthough precise data on how different demographic groups voted in this election might take time to emerge, first-time and young voters were Modi’s most significant bloc of supporters in 2014. My research suggests that they remain loyal to him now. \nI spent a month during this election cycle traveling around India, interviewing millennials and first-time voters about the political choice in front of them. In that entire period, I heard only one name uttered with confidence: Modi. \n“Who else can I vote for? Nobody else can fix India or protect us from Pakistan,” a 25-year-old unemployed engineer in the battleground state of Madhya Pradesh told me. “Look at how he held rich people accountable with demonetization. Look at how he made Pakistan pay for Pulwama.” \nIn 2014, Modi captured the keys to India’s Parliament by outlining an aspirational agenda for the country: creating millions of jobs, building world-class infrastructure and eliminating corruption. This image was particularly appealing to young voters, who came of age as India’s economic growth began to slow, and often struggled to find well-paying employment. Although disruptive, his decisions to reform the country’s arcane tax code and update its colonial-era bankruptcy rules won him plaudits from the business community and seemed to suggest that he would meet his goals. \nBut as his term continued, the scale of economic growth promised in 2014 slowed amidst a flurry of self-inflicted challenges. In November 2016, Modi “demonetized” almost 86 percent of the country’s currency, creating a huge cash crunch in a cash-driven economy. Along with the hasty implementation of a new Goods and Services Tax, this took a toll on thousands of small businesses, and even more jobs in the informal sector vanished. \n Yet Modi and the BJP managed to package and sell these policies to their young voters with ease. Demonetization was advertised as a bold, courageous move to tackle black money and entrenched corruption, a move only someone as audacious as the prime minister could undertake. \nBut most significantly, young Indians believed they had no credible alternative. “Nobody will give us jobs. We will have to move elsewhere to find employment. But who can fix this problem? Only Modi can clean this country up,” a voter from the engineering college in Indore told me. \nThis gets to the heart of Modi’s reelection strategy: It involved deflecting focus from serious macroeconomic challenges, running an emotional campaign and presenting himself as the only person capable of cleaning up the proverbial mess that the country finds itself in. \nIt is not that young Indians did not have a choice in this election. They had plenty. But in the end, the allure of a decisive leader proved more important than the BJP’s economic stumbles."
    }
  ]
}
